docs/benchmark/pmem-redis.txt
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 128 -n 100000
====== SET ======
  100000 requests completed in 1.37 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

99.67% <= 1 milliseconds
99.98% <= 2 milliseconds
100.00% <= 2 milliseconds
72992.70 requests per second

====== GET ======
  100000 requests completed in 1.30 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

99.93% <= 1 milliseconds
100.00% <= 1 milliseconds
77101.00 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 512 -n 100000
====== SET ======
  100000 requests completed in 1.33 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

99.78% <= 1 milliseconds
100.00% <= 1 milliseconds
75075.07 requests per second

====== GET ======
  100000 requests completed in 1.32 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

99.93% <= 1 milliseconds
100.00% <= 1 milliseconds
75757.57 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 1024 -n 100000
====== SET ======
  100000 requests completed in 1.43 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

99.55% <= 1 milliseconds
100.00% <= 1 milliseconds
69735.01 requests per second

====== GET ======
  100000 requests completed in 1.33 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

99.82% <= 1 milliseconds
100.00% <= 1 milliseconds
75131.48 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 4096 -n 100000
====== SET ======
  100000 requests completed in 1.51 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

99.81% <= 1 milliseconds
100.00% <= 1 milliseconds
66269.05 requests per second

====== GET ======
  100000 requests completed in 1.43 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

99.59% <= 1 milliseconds
100.00% <= 1 milliseconds
69881.20 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 8192 -n 100000
====== SET ======
  100000 requests completed in 1.77 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

90.53% <= 1 milliseconds
99.98% <= 2 milliseconds
100.00% <= 2 milliseconds
56369.79 requests per second

====== GET ======
  100000 requests completed in 1.58 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

99.23% <= 1 milliseconds
100.00% <= 1 milliseconds
63371.36 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 10240 -n 100000
====== SET ======
  100000 requests completed in 1.92 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

81.84% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
51948.05 requests per second

====== GET ======
  100000 requests completed in 1.65 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

98.92% <= 1 milliseconds
100.00% <= 1 milliseconds
60569.35 requests per second