docs/benchmark/redis.txt
[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 128 -n 100000
====== SET ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

99.94% <= 1 milliseconds
100.00% <= 1 milliseconds
77399.38 requests per second

====== GET ======
  100000 requests completed in 1.30 seconds
  50 parallel clients
  128 bytes payload
  keep alive: 1

99.93% <= 1 milliseconds
100.00% <= 1 milliseconds
76687.12 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 512 -n 100000
====== SET ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

99.92% <= 1 milliseconds
100.00% <= 1 milliseconds
77279.75 requests per second

====== GET ======
  100000 requests completed in 1.33 seconds
  50 parallel clients
  512 bytes payload
  keep alive: 1

99.92% <= 1 milliseconds
100.00% <= 1 milliseconds
75187.97 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 1024 -n 100000
====== SET ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

99.89% <= 1 milliseconds
100.00% <= 1 milliseconds
77579.52 requests per second

====== GET ======
  100000 requests completed in 1.34 seconds
  50 parallel clients
  1024 bytes payload
  keep alive: 1

99.83% <= 1 milliseconds
100.00% <= 1 milliseconds
74906.37 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 4096 -n 100000
====== SET ======
  100000 requests completed in 1.34 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

99.58% <= 1 milliseconds
100.00% <= 1 milliseconds
74460.16 requests per second

====== GET ======
  100000 requests completed in 1.44 seconds
  50 parallel clients
  4096 bytes payload
  keep alive: 1

99.41% <= 1 milliseconds
99.98% <= 2 milliseconds
100.00% <= 2 milliseconds
69492.70 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 8192 -n 100000
====== SET ======
  100000 requests completed in 1.40 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

99.35% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
71530.76 requests per second

====== GET ======
  100000 requests completed in 1.57 seconds
  50 parallel clients
  8192 bytes payload
  keep alive: 1

99.19% <= 1 milliseconds
100.00% <= 1 milliseconds
63613.23 requests per second


[root@iZbp1gqpip163xihy2oh56Z ~]# redis-benchmark -t set,get -d 10240 -n 100000
====== SET ======
  100000 requests completed in 1.43 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

99.37% <= 1 milliseconds
100.00% <= 1 milliseconds
70077.09 requests per second

====== GET ======
  100000 requests completed in 1.61 seconds
  50 parallel clients
  10240 bytes payload
  keep alive: 1

99.03% <= 1 milliseconds
100.00% <= 1 milliseconds
62189.05 requests per second